/*
    Εκφωνηση

    Να γραφτεί πρόγραμμα x στο οποίο η διεργασία πατέρας δημιουργεί n διεργασίες
    παιδία και τους μοιράζει μέσω διοχετεύσεων (pipes) εργασίες που της αναθέτει
    ο χρήστης από την γραμμή εντολών.

    Παραδειγμα εκτελεσης προγραματος:
        ./ask3 n --round-robin
        ./ask3 n --random
    Τo όρισμα n πρέπει να είναι ακέραιος θετικός αριθμός που προσδιορίζει το πλήθος
    των διεργασιών παιδιών που θα δημιουργήσει ο πατέρας.
    Το όρισμα round-robin ή random προσδιορίζει τον τρόπο με τον οποίο η διεργασία
    πατέρας μοιράζει τις εργασίες:
        - round-robin: με κυκλική επαναφορά
        - random: με τυχαίο τρόπο
    Αν δεν δοθούν σωστά τα ορίσματα η διεργασίας πατέρας εκτυπώνει το παρακάτω
    μήνυμα και τερματίζει:
        Usage: ask3 <nChildren> [--random] [--round-robin]
    Ως default μεθοδολογία διαμοιρασμού εργασιών εάν δεν προσδιοριστεί από τον
    χρήστη θεωρείτε η round-robin.

    Η διεργασία πατέρας μπορεί να δεχθεί από τον χρήστη μέσω του terminal τις παρακάτω
    εντολές:
    - help: Στην περίπτωση αυτή η διεργασία πατέρας εκτυπώνει το μήνυμα:
        "Type a number to send job to a child!"
    - exit: Στην περίπτωση αυτή η διεργασία πατέρας τερματίζει αφού πρώτα τερματίσει
    όλα τα παιδιά εκτυπώνοντας κατάλληλα μηνύματα π.χ. "All children terminated"
    - Έναν ακέραιο αριθμό π.χ. 12. Στην περίπτωση αυτή η διεργασία πατέρας διαλέγει
    μια διεργασία παιδί και της αναθέτει την εργασία στέλνοντας της τον αριθμό μέσω
    μιας διοχέτευσης και εκτυπώνει το μήνυμα: "[Parent] Assigned 12 to child 5"
    - Σε κάθε άλλη περίπτωση να εκτυπώνεται το μήνυμα:
        "Type a number to send job to a child!"

    Κάθε διεργασία παιδί μπορεί να δεχθεί από την διεργασία πατέρα μέσω μιας διοχέτευσης
    ένα αριθμό τον οποίο μειώνει κατά 1, περιμένει για 10 secs και τον επιστρέφει στην
    διεργασία πατέρα μέσω μιας άλλης διοχέτευσης. Αυτό γίνεται επαναληπτικά μέχρι να την
    τερματίσει η διεργασία πατέρας.
*/

/*
    Θεωρια

    Οι διοχετευσεις λειτουργούν ως σωληνώσεις που επιτρέπουν σε δύο διεργασίες να
    επικοινωνούν.
    Συνήθως, μια γονική διαδικασία δημιουργεί μια διοχέτευση και την χρησιμοποιεί
    για να επικοινωνεί με μια διεργασία που δημιούργησε.
    Οι συνηθισμένες διοχετεύσεις δεν είναι προσβάσιμες έξω από την διεργασία που
    την δημιούργησε.
    Επώνυμες διοχετεύσεις (Named pipes) – είναι προσβάσιμες χωρίς να υπάρχει σχέση
    γονέα-παιδιού ή παιδιών ίδιου πατέρα.

    Οι κοινές διοχετεύσεις επιτρέπουν την επικοινωνία σε τυπικό τρόπο παραγωγού-
    καταναλωτή.
    - Ο παραγωγός γράφει στο ένα άκρο (άκρο εγγραφής write-end).
    - Ο καταναλωτής διαβάζει από το άλλο άκρο (άκρο ανάγνωσης read-end)
    Επομένως, οι κοινές διοχετεύσεις είναι μονής κατεύθυνσης.
    Απαιτείται σχέση γονέα-παιδιού μεταξύ των διεργασιών επικοινωνίας.
*/

/*
    Εργαλεια

    Η κλήση συστήματος pipe() δημιουργεί μια διοχέτευση, ένα κανάλι δεδομένων μονής
    κατεύθυνσης που μπορεί να χρησιμοποιηθεί για επικοινωνία μεταξύ διεργασιών.
        `int pipe(int fd[2])`
    Ο πίνακας fd χρησιμοποιείται για την επιστροφή δύο περιγραφητών αρχείων που
    αναφέρονται στα άκρα της διοχέτευσης. Το στοιχείο fd[0] του πίνακα αναφέρεται
    στο άκρο ανάγνωσης της διοχέτευσης και το fd [1] αναφέρεται στο άκρο εγγραφής.
    Περισσότερες πληροφορίες: https://linux.die.net/man/2/pipe

    H διεργασία πατέρας μπορεί να δεχθεί δεδομένα από ένα σύνολο διοχετεύσεων ή από
    το terminal, αυτό είναι εφικτό να γίνει μέσω της poll().
    H poll() επιτρέπει σε ένα πρόγραμμα να παρακολουθεί πολλούς περιγραφητές αρχείων,
    έως ότου ένας ή περισσότεροι από τους περιγραφητές αρχείων γίνουν «έτοιμοι».
    Περισσότερες πληροφορίες: https://man7.org/linux/man-pages/man2/poll.2.html

    Για τυχαία παραγωγή αριθμών που είναι πιθανό να σας χρειαστεί στον διαμοιρασμό
    των εργασιών με random τρόπο προτείνεται η rand().
    Περισσότερες πληροφορίες:
        https://man7.org/linux/man-pages/man3/rand.3.html
        https://www.tutorialspoint.com/c_standard_library/c_function_rand.htm

    Για δυναμική διάθεση μνήμης που είναι πιθανό να σας χρειαστεί για τον ορισμό
    πινάκων αφού διαβάσετε το n από την γραμμή εντολών προτείνεται η malloc().
    Περισσότερε πληροφορίες:
        https://man7.org/linux/man-pages/man3/malloc.3.html
        https://www.tutorialspoint.com/c_standard_library/c_function_malloc.htm

    Χρήσιμα links:
        https://man7.org/linux/man-pages/man2/pipe.2.html
        https://www.gnu.org/software/libc/manual/html_node/Pipes-and-FIFOs.html#Pipes-and-FIFOs
*/
